In [1]:
# python -m pip install mysql-connector

import mysql.connector
#importing database
database = mysql.connector.connect(
    host="localhost",
    user="root",
    password="",
    database = "class3pm"
)
db = database.cursor()

In [2]:
#adding new row, hardcoding data
sql = "INSERT INTO profile (name,address,phone,class) VALUES ('Nabin','Kathmandu','9876323345',2)"
db.execute(sql)
database.commit()   #change database -- commit()

In [3]:
#making data entry dynamic using for loop and string format
n = int(input("Enter n = "))
for i in range(n):
    name = input("Enter name = ")
    add = input("Enter address = ")
    phone = input("Enter phone = ")
    clas = int(input("Enter class = "))
    
    sql = f"INSERT INTO profile (name,address,phone,class) VALUES ('{name}','{add}','{phone}',{clas})"
    db.execute(sql)
database.commit()

Enter n = 2
Enter name = Hari
Enter address = Lumbini
Enter phone = 3332225555
Enter class = 6
Enter name = Shiva
Enter address = Pokhara
Enter phone = 4443332267
Enter class = 5

In [4]:
#show updated table
db.execute("SELECT * FROM profile")
result = db.fetchall()
for x in result:
    print(x)

(1, 'Ram', 'Kathmandu', '9823322592', 1)
(2, 'Shyam', 'Patan', '9992223456', 2)
(3, 'Shyam', 'Bhojpur', '8882342234', 3)
(4, 'Nabin', 'Bhojpur', '9879877789', 3)
(5, 'Hari', 'Patan', '9993332345', 5)
(6, 'Nabin', 'Kathmandu', '9876323345', 2)
(7, 'Hari', 'Lumbini', '3332225555', 6)
(8, 'Shiva', 'Pokhara', '4443332267', 5)